Repository: MrLappes/platepal-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es

# componentsCalendarCalendarDayDetailNoMealsLoggedForDay
source: No meals logged for this day
de: Keine Mahlzeiten für diesen Tag protokolliert
es: No hay comidas registradas para este día

# componentsCalendarCalendarDayDetailUnknownDish
source: Unknown Dish
de: Unbekanntes Gericht
es: Plato Desconocido

# componentsCalendarMacroSummaryCalories
source: Calories
de: Kalorien
es: Calorías

# componentsCalendarMacroSummaryCarbs
source: Carbs
de: Kohlenhydrate
es: Carbohidratos

# componentsCalendarMacroSummaryEstimatedCalories
source: Estimated Calories
de: Geschätzte Kalorien
es: Calorías Estimadas

# componentsCalendarMacroSummaryEstimatedCaloriesMessage
source: This data is estimated based on your profile settings and activity level since health data wasn't available for this date.
de: Diese Daten sind basierend auf Ihren Profileinstellungen und Aktivitätslevel geschätzt, da für dieses Datum keine Gesundheitsdaten verfügbar waren.
es: Estos datos están estimados basándose en la configuración de tu perfil y nivel de actividad ya que los datos de salud no estaban disponibles para esta fecha.

# componentsCalendarMacroSummaryEstimatedCaloriesToday
source: Estimated Calories (Today)
de: Geschätzte Kalorien (Heute)
es: Calorías Estimadas (Hoy)

# componentsCalendarMacroSummaryEstimatedCaloriesTodayMessage
source: This is your estimated calorie expenditure for today based on your activity level. Since the day isn't complete yet, this represents your base metabolic rate plus estimated activity. Your actual calories burned may be higher if you do more activities today.
de: Dies ist Ihr geschätzter Kalorienverbrauch für heute basierend auf Ihrem Aktivitätslevel. Da der Tag noch nicht abgeschlossen ist, repräsentiert dies Ihren Grundumsatz plus geschätzte Aktivität. Ihre tatsächlich verbrannten Kalorien können höher sein, wenn Sie heute mehr Aktivitäten durchführen.
es: Este es tu gasto calórico estimado para hoy basado en tu nivel de actividad. Como el día aún no está completo, esto representa tu tasa metabólica basal más actividad estimada. Tus calorías realmente quemadas pueden ser mayores si realizas más actividades hoy.

# componentsCalendarMacroSummaryFat
source: Fat
de: Fett
es: Grasa

# componentsCalendarMacroSummaryFiber
source: Fiber
de: Ballaststoffe
es: Fibra

# componentsCalendarMacroSummaryGetAiTip
source: Get AI Tip
de: KI-Tipp
es: Obtener Consejo IA

# componentsCalendarMacroSummaryHealthDataMessage
source: This data was gathered from health data on your phone, providing accurate calories burned information from your fitness activities for this complete day.
de: Diese Daten wurden von den Gesundheitsdaten auf Ihrem Telefon gesammelt und liefern genaue Informationen über verbrannte Kalorien aus Ihren Fitnessaktivitäten für diesen vollständigen Tag.
es: Estos datos fueron recopilados de los datos de salud en tu teléfono, proporcionando información precisa sobre las calorías quemadas de tus actividades de fitness para este día completo.

# componentsCalendarMacroSummaryHealthDataTitle
source: Health Data
de: Gesundheitsdaten
es: Datos de Salud

# componentsCalendarMacroSummaryHealthDataTodayMessage
source: This data was gathered from health data on your phone. Since today isn't complete yet, this represents calories burned so far today. Your total may increase as you continue activities throughout the day.
de: Diese Daten wurden von den Gesundheitsdaten auf Ihrem Telefon gesammelt. Da der heutige Tag noch nicht abgeschlossen ist, zeigt dies die bisher heute verbrannten Kalorien an. Ihre Gesamtsumme kann sich erhöhen, wenn Sie den Tag über weitere Aktivitäten durchführen.
es: Estos datos fueron recopilados de los datos de salud en tu teléfono. Como el día de hoy aún no está completo, esto representa las calorías quemadas hasta ahora. Tu total puede aumentar mientras continúes con actividades durante el día.

# componentsCalendarMacroSummaryHealthDataTodayPartial
source: Health Data (Today - Partial)
de: Gesundheitsdaten (Heute - Teilweise)
es: Datos de Salud (Hoy - Parcial)

# componentsCalendarMacroSummaryNutritionSummary
source: Nutrition Summary
de: Nährwerte
es: Resumen Nutricional

# componentsCalendarMacroSummaryProtein
source: Protein
es: Proteína

# componentsCommonOk
source: OK
es: Aceptar

# componentsChatAgentStepsModalAgentProcessingSteps
source: Agent Processing Steps
de: Agenten-Prozessschritte
es: Pasos de procesamiento del agente

# componentsChatAgentStepsModalCopiedToClipboard
source: Copied to clipboard
de: In die Zwischenablage kopiert
es: Copiado al portapapeles

# componentsChatAgentStepsModalCopyAll
source: Copy All
de: Alles kopieren
es: Copiar todo

# componentsChatAgentStepsModalViewFullData
source: View Full Data
de: Gesamte Daten anzeigen
es: Ver datos completos

# componentsChatAgentStepsModalViewFullPrompt
source: View Full Prompt
de: Gesamtes Prompt anzeigen
es: Ver prompt completo

# componentsChatAgentStepsModalThinkingProcessTitle
source: 🧠 Thinking Process
de: 🧠 Denkprozess
es: 🧠 Proceso de Pensamiento

# componentsChatAgentStepsModalThinkingProcessSubtitle
source: Real-time agent thinking steps
de: Echtzeit-Denkschritte des Agenten
es: Pasos de pensamiento del agente en tiempo real

# componentsChatAgentStepsModalProcessingStepsTitle
source: ⚙️ Processing Steps
de: ⚙️ Verarbeitungs-Schritte
es: ⚙️ Pasos de Procesamiento

# componentsChatAgentStepsModalProcessingStepsSubtitle
source: Detailed step-by-step execution
de: Detaillierte Schritt-für-Schritt-Ausführung
es: Ejecución detallada paso a paso

# componentsChatAgentStepsModalProcessingSummary
source: Processing Summary
de: Verarbeitungszusammenfassung
es: Resumen de Procesamiento

# componentsChatAgentStepsModalCopySummaryTooltip
source: Copy summary data
de: Zusammenfassungsdaten kopieren
es: Copiar datos de resumen

# componentsChatAgentStepsModalProcessingTime
source: Processing Time
de: Verarbeitungszeit
es: Tiempo de Procesamiento

# componentsChatAgentStepsModalBotType
source: Bot Type
de: Bot-Typ
es: Tipo de Bot

# componentsChatAgentStepsModalTotalSteps
source: Total Steps
de: Gesamtschritte
es: Pasos Totales

# componentsChatAgentStepsModalSkippedSteps
source: Skipped Steps
de: Übersprungene Schritte
es: Pasos Omitidos

# componentsChatAgentStepsModalFailedSteps
source: Failed Steps
de: Fehlgeschlagene Schritte
es: Pasos Fallidos

# componentsChatAgentStepsModalErrorRecovery
source: Error Recovery
de: Fehlerbehebung
es: Recuperación de Errores

# componentsChatAgentStepsModalCompletedSteps
source: Completed Steps
de: Abgeschlossene Schritte
es: Pasos Completados

# componentsChatAgentStepsModalDeepSearch
source: Deep Search
de: Tiefensuche
es: Búsqueda Profunda

# componentsChatAgentStepsModalEnabled
source: Enabled
de: Aktiviert
es: Habilitado

# componentsChatAgentStepsModalDisabled
source: Disabled
de: Deaktiviert
es: Deshabilitado

# componentsChatAgentStepsModalModifications
source: Modifications
de: Änderungen
es: Modificaciones

# componentsChatAgentStepsModalNoModifications
source: None needed ✨
de: Keine nötig ✨
es: Ninguna necesaria ✨

# componentsChatAgentStepsModalPerfectProcessing
source: Perfect processing! No corrections or modifications were needed.
de: Perfekte Verarbeitung! Keine Korrekturen oder Modifikationen erforderlich.
es: ¡Procesamiento perfecto! No se necesitaron correcciones ni modificaciones.

# componentsChatAgentStepsModalPipelineModificationsTitle
source: ✨ Pipeline Modifications
de: ✨ Pipeline-Änderungen
es: ✨ Modificaciones del Pipeline

# componentsChatAgentStepsModalPipelineModificationsSubtitle
source: No modifications were needed - your request was processed smoothly!
de: Keine Änderungen erforderlich - Ihre Anfrage wurde problemlos verarbeitet!
es: No se necesitaron modificaciones - ¡tu solicitud se procesó sin problemas!

# componentsChatAgentStepsModalStepModifications
source: 🔧 Step Modifications
de: 🔧 Schritt-Änderungen
es: 🔧 Modificaciones de Paso

# componentsChatAgentStepsModalCopyModifications
source: Copy modifications
de: Änderungen kopieren
es: Copiar modificaciones

# componentsChatAgentStepsModalSummaryLabel
source: Summary: {summary}
de: Zusammenfassung: {summary}
es: Resumen: {summary}

# componentsChatAgentStepsModalEnhancedSystemPrompt
source: 🤖 Enhanced System Prompt
de: 🤖 Verbesserter System-Prompt
es: 🤖 Prompt de Sistema Mejorado

# componentsChatAgentStepsModalCopyEnhancedPrompt
source: Copy enhanced system prompt
de: Verbesserten System-Prompt kopieren
es: Copiar prompt de sistema mejorado

# componentsChatDishSuggestionCardHighProtein
source: High protein dish
de: Proteinreiches Gericht
es: Plato alto en proteína

# componentsChatDishSuggestionCardHighCarb
source: High carb dish
de: Kohlenhydratreiches Gericht
es: Plato alto en carbohidratos

# componentsChatDishSuggestionCardHighFat
source: High fat dish
de: Fettreiches Gericht
es: Plato alto en grasa

# componentsChatDishSuggestionCardBalanced
source: Balanced dish
de: Ausgewogenes Gericht
es: Plato equilibrado

# componentsChatDishSuggestionCardUnbalanced
source: Unbalanced dish
de: Unausgewogenes Gericht
es: Plato desequilibrado

# componentsChatDishSuggestionCardProtein
source: Protein
es: Proteína

# componentsChatDishSuggestionCardCarbs
source: Carbs
de: Kohlenhydrate
es: Carbohidratos

# componentsChatDishSuggestionCardFat
source: Fat
de: Fett
es: Grasa

# componentsChatDishSuggestionCardCalories
source: Calories
de: Kalorien
es: Calorías

# componentsChatDishSuggestionCardInspect
source: Details
es: Detalles

# componentsChatAgentStepsModalLengthLabel
source: Length: {count} characters
de: Länge: {count} Zeichen
es: Longitud: {count} caracteres

# componentsChatAgentStepsModalTechnicalDetails
source: Technical Details
de: Technische Details
es: Detalles Técnicos

# componentsChatAgentStepsModalDataChanges
source: Data Changes
de: Datenänderungen
es: Cambios de Datos

# componentsChatAgentStepsModalBefore
source: Before
de: Vorher
es: Antes

# componentsChatAgentStepsModalAfter
source: After
de: Nachher
es: Después

# componentsChatAgentStepsModalStatusSkipped
source: Skipped
de: Übersprungen
es: Omitido

# componentsChatAgentStepsModalStatusErrorRecovered
source: Error recovered
de: Fehler behoben
es: Error recuperado

# componentsChatAgentStepsModalStatusErrorHandlingFailed
source: Error handling failed
de: Fehlerbehandlung fehlgeschlagen
es: Fallo en manejo de error

# componentsChatAgentStepsModalStatusCompletedSuccessfully
source: Completed successfully
de: Erfolgreich abgeschlossen
es: Completado con éxito

# componentsChatAgentStepsModalFailed
source: Failed
de: Fehlgeschlagen
es: Fallido

# componentsChatAgentStepsModalBadgeEmergencyOverrides
source: Emergency overrides
de: Notfall-Überschreibungen
es: Sobrescrituras de emergencia

# componentsChatAgentStepsModalBadgeAiValidations
source: AI validations
de: KI-Validierungen
es: Validaciones IA

# componentsChatAgentStepsModalBadgeAutomaticFixes
source: Automatic fixes
de: Automatische Korrekturen
es: Correcciones automáticas

# componentsChatAgentStepsModalTotalModifications
source: Total modifications: {count}
de: Gesamtänderungen: {count}
es: Total de modificaciones: {count}

# componentsChatAgentStepsModalSkipDetails
source: ⏭️ Skip Details
de: ⏭️ Details überspringen
es: ⏭️ Omitir Detalles

# componentsChatAgentStepsModalMetadata
source: 📊 Metadata
de: 📊 Metadaten
es: 📊 Metadatos

# componentsChatAgentStepsModalDataOutput
source: 📤 Data Output
de: 📤 Datenausgabe
es: 📤 Salida de Datos

# componentsChatAgentStepsModalErrorDetails
source: ❌ Error Details
de: ❌ Fehlerdetails
es: ❌ Detalles del Error

# componentsChatAgentStepsModalRawStepData
source: 🔍 Raw Step Data
de: 🔍 Rohdaten der Schritte
es: 🔍 Datos Brutos del Paso

# componentsChatAgentStepsModalTimeLabel
source: Time: {time}
de: Zeit: {time}
es: Tiempo: {time}

# componentsCommonCopyToClipboard
source: Copy to clipboard
de: In die Zwischenablage kopieren
es: Copiar al portapapeles

# componentsChatBotProfileCustomizationDialogAngryGreg
source: Angry Greg
de: Wütender Greg
es: Greg Enojado

# componentsChatBotProfileCustomizationDialogBotName
source: Bot Name
es: Nombre del Bot

# componentsChatBotProfileCustomizationDialogCancel
source: Cancel
de: Abbrechen
es: Cancelar

# componentsChatBotProfileCustomizationDialogCasualGymBro
source: Casual Gym Bro
de: Entspannter Gym-Bro
es: Gym Bro Casual

# componentsChatBotProfileCustomizationDialogChangeAvatar
source: Change Avatar
de: Avatar ändern
es: Cambiar Avatar

# componentsChatBotProfileCustomizationDialogChooseFromGallery
source: Choose from Gallery
de: Aus Galerie wählen
es: Elegir de Galería

# componentsChatBotProfileCustomizationDialogEditBotProfile
source: Edit Bot Profile
de: Bot-Profil bearbeiten
es: Editar Perfil del Bot

# componentsChatBotProfileCustomizationDialogFitnessCoach
source: Fitness Coach
de: Fitness-Trainer
es: Entrenador de Fitness

# componentsChatBotProfileCustomizationDialogNiceAndFriendly
source: Nice & Friendly
de: Nett & freundlich
es: Amable y Amigable

# componentsChatBotProfileCustomizationDialogPersonality
source: Personality
de: Persönlichkeit
es: Personalidad

# componentsChatBotProfileCustomizationDialogProfessionalNutritionist
source: Professional Nutritionist
de: Professioneller Ernährungsberater
es: Nutricionista Profesional

# componentsChatBotProfileCustomizationDialogProfileSaved
source: Profile saved successfully
de: Profil erfolgreich gespeichert
es: Perfil guardado exitosamente

# componentsChatBotProfileCustomizationDialogProfileSaveFailed
source: Failed to save profile
de: Profil speichern fehlgeschlagen
es: Error al guardar perfil

# componentsChatBotProfileCustomizationDialogRemoveAvatar
source: Remove Avatar
de: Avatar entfernen
es: Eliminar Avatar

# componentsChatBotProfileCustomizationDialogRequiredField
source: This field is required
de: Dieses Feld ist erforderlich
es: Este campo es requerido

# componentsChatBotProfileCustomizationDialogSave
source: Save
de: Speichern
es: Guardar

# componentsChatBotProfileCustomizationDialogTakePhoto
source: Take Photo
de: Foto aufnehmen
es: Tomar Foto

# componentsChatBotProfileCustomizationDialogVeryAngryBro
source: Very Angry Bro
de: Sehr wütender Bro
es: Bro Muy Enojado

# componentsChatBotPersonalityDescriptionNutritionist
source: Professional & Evidence-based
de: Professionell & Evidenzbasiert
es: Profesional y Basado en Evidencia

# componentsChatBotPersonalityDescriptionCasualGymbro
source: Casual & Motivational
de: Lässig & Motivierend
es: Casual y Motivador

# componentsChatBotPersonalityDescriptionAngryGreg
source: Intense & Supplement-focused
de: Intensiv & Supplement-fokussiert
es: Intenso y Enfocado en Suplementos

# componentsChatBotPersonalityDescriptionVeryAngryBro
source: Extremely Intense
de: Extrem Intensiv
es: Extremadamente Intenso

# componentsChatBotPersonalityDescriptionFitnessCoach
source: Encouraging & Supportive
de: Ermutigend & Unterstützend
es: Alentador y Solidario

# componentsChatBotPersonalityDescriptionNice
source: Friendly & Helpful
de: Freundlich & Hilfsbereit
es: Amable y Servicial

# componentsChatEditBotProfileTooltip
source: Edit Bot Profile
de: Bot-Profil bearbeiten
es: Editar perfil del bot

# componentsChatChatInputErrorPickingImage
source: Error picking image: {error}
de: Fehler beim Auswählen des Bildes: {error}
es: Error al seleccionar la imagen: {error}

# componentsChatMessageBubbleModificationEmergency
source: {count} emergency fixes applied
de: {count} Notfallkorrekturen angewendet
es: {count} correcciones de emergencia aplicadas

# componentsChatMessageBubbleModificationAi
source: {count} AI enhancements applied
de: {count} KI-Verbesserungen angewendet
es: {count} mejoras de IA aplicadas

# componentsChatMessageBubbleModificationAutomatic
source: {count} automatic improvements applied
de: {count} automatische Verbesserungen angewendet
es: {count} mejoras automáticas aplicadas

# componentsChatMessageBubbleYou
source: You
de: Du
es: Tú

# componentsChatMessageBubbleAssistant
source: PlatePal Assistant
de: Assistent
es: Asistente

# componentsChatMessageBubbleSending
source: Sending...
de: Wird gesendet...
es: Enviando...

# componentsChatMessageBubbleSuggestedDishes
source: Suggested Dishes
de: Vorgeschlagene Gerichte
es: Platos sugeridos

# componentsChatMessageBubbleRecommendation
source: Recommendation
de: Empfehlung
es: Recomendación

# componentsChatMessageBubbleNoRecommendationsAvailable
source: No recommendations available.
de: Keine Empfehlungen verfügbar.
es: No hay recomendaciones disponibles.

# componentsChatChatInputImageAttached
source: Image attached
de: Bild angehängt
es: Imagen adjuntada

# componentsChatChatInputIngredientsAdded
source: Ingredients Added
de: Zutaten hinzugefügt
es: Ingredientes agregados

# componentsChatChatInputScanBarcode
source: Scan Barcode
de: Barcode scannen
es: Escanear Código de Barras

# componentsChatChatInputSearchProduct
source: Search Product
de: Produkt suchen
es: Buscar Producto

# componentsChatChatInputSendMessage
source: Send message
de: Nachricht senden
es: Enviar mensaje

# componentsChatChatInputTypeMessage
source: Type a message...
de: Nachricht eingeben...
es: Escribe un mensaje...

# componentsChatChatWelcomeAnalyzeNutrition
source: Analyze nutrition
de: Ernährung analysieren
es: Analizar nutrición

# componentsChatChatWelcomeCalculateMacros
source: Calculate macros
de: Makros berechnen
es: Calcular macros

# componentsChatChatWelcomeChatWelcomeSubtitle
source: Your AI nutrition assistant is here to help
de: Ihr KI-Ernährungsassistent ist hier, um zu helfen
es: Tu asistente de nutrición IA está aquí para ayudar

# componentsChatChatWelcomeChatWelcomeTitle
source: Welcome to PlatePal
de: Willkommen bei PlatePal
es: Bienvenido a PlatePal

# componentsChatChatWelcomeFindAlternatives
source: Find alternatives
de: Alternativen finden
es: Encontrar alternativas

# componentsChatChatWelcomeGetStartedToday
source: Get started today
de: Heute beginnen
es: Comienza hoy

# componentsChatChatWelcomeIngredientInfo
source: Ingredient info
de: Zutatensinfo
es: Info de ingredientes

# componentsChatChatWelcomeMealPlan
source: Meal plan help
de: Ernährungsplan-Hilfe
es: Ayuda con plan de comidas

# componentsChatChatWelcomeSuggestMeal
source: Suggest a meal
de: Mahlzeit vorschlagen
es: Sugerir comida

# componentsChatChatWelcomeSuggestMealSubtitle
source: Get personalized meal recommendations
de: Erhalte personalisierte Mahlzeitenempfehlungen
es: Obtén recomendaciones personalizadas de comidas

# componentsChatChatWelcomeSuggestMealMessage
source: Suggest a healthy meal based on my fitness goals
de: Schlag mir eine gesunde Mahlzeit vor, basierend auf meinen Fitnesszielen
es: Sugiéreme una comida saludable basada en mis objetivos de fitness

# componentsChatChatWelcomeAnalyzeNutritionSubtitle
source: Analyze the nutritional values of your meals
de: Analysiere die Nährwerte deiner Mahlzeiten
es: Analiza los valores nutricionales de tus comidas

# componentsChatChatWelcomeAnalyzeNutritionMessage
source: Help me analyze the nutritional values in my meal
de: Hilf mir, die Nährwerte in meiner Mahlzeit zu analysieren
es: Ayúdame a analizar los valores nutricionales de mi comida

# componentsChatChatWelcomeFindAlternativesSubtitle
source: Discover healthy food alternatives
de: Entdecke gesunde Lebensmittelalternativen
es: Descubre alternativas saludables de alimentos

# componentsChatChatWelcomeFindAlternativesMessage
source: Find healthy alternatives to my current meal
de: Finde gesunde Alternativen zu meiner aktuellen Mahlzeit
es: Encuentra alternativas saludables para mi comida actual

# componentsChatChatWelcomeCalculateMacrosSubtitle
source: Calculate macros for your meals
de: Berechne Makros für deine Mahlzeiten
es: Calcula los macros para tus comidas

# componentsChatChatWelcomeCalculateMacrosMessage
source: Help me calculate the macros for my meals
de: Hilf mir, die Makros für meine Mahlzeiten zu berechnen
es: Ayúdame a calcular los macros para mis comidas

# componentsChatChatWelcomeMealPlanSubtitle
source: Create weekly meal plans
de: Erstelle wöchentliche Essenspläne
es: Crea planes de comidas semanales

# componentsChatChatWelcomeMealPlanMessage
source: Help me create a weekly meal plan
de: Hilf mir, einen wöchentlichen Ernährungsplan zu erstellen
es: Ayúdame a crear un plan de comidas semanal

# componentsChatChatWelcomeIngredientInfoSubtitle
source: Learn more about ingredients and their benefits
de: Erfahre mehr über Zutaten und deren Vorteile
es: Aprende más sobre los ingredientes y sus beneficios

# componentsChatChatWelcomeIngredientInfoMessage
source: Tell me about the nutritional benefits of ingredients
de: Erzähl mir von den ernährungsphysiologischen Vorteilen von Zutaten
es: Háblame sobre los beneficios nutricionales de los ingredientes

# componentsChatChatWelcomeWhatCanIHelpWith
source: What can I help you with?
de: Wobei kann ich Ihnen helfen?
es: ¿En qué puedo ayudarte?

# componentsChatDishSuggestionCardDetails
source: Details
es: Detalles

# componentsChatDishSuggestionCardErrorOpeningDishScreen
source: Error opening dish screen: {error}
de: Fehler beim Öffnen des Gerichtsbildschirms: {error}
es: Error al abrir la pantalla del plato: {error}

# componentsChatDishSuggestionCardLogDish
source: Log Dish
de: Gericht eintragen
es: Registrar Plato

# componentsChatMessageBubbleClose
source: Close
de: Schließen
es: Cerrar

# componentsChatMessageBubbleIngredients
source: Ingredients
de: Zutaten
es: Ingredientes

# componentsChatMessageBubbleMessageCopied
source: Message copied to clipboard
de: Nachricht in Zwischenablage kopiert
es: Mensaje copiado al portapapeles

# componentsChatMessageBubbleRetryMessage
source: Retry
de: Wiederholen
es: Reintentar

# componentsChatMessageBubbleSelect
source: Select
de: Auswählen
es: Seleccionar

# componentsChatMessageBubbleTapToViewAgentSteps
source: Tap to view agent steps
de: Agent-Details anzeigen
es: Toca para ver los pasos del agente

# componentsChatMessageBubbleYesterday
source: Yesterday
de: Gestern
es: Ayer

# componentsChatNutritionAnalysisCardAddToMeals
source: Add to Meals
de: Zu Mahlzeiten hinzufügen
es: Agregar a Comidas

# componentsChatNutritionAnalysisCardCookingInstructions
source: Cooking Instructions
de: Kochanweisungen
es: Instrucciones de Cocina

# componentsChatNutritionAnalysisCardDishName
source: Dish Name
de: Gerichtname
es: Nombre del Plato

# componentsChatNutritionAnalysisCardMealType
source: Meal Type
de: Mahlzeitentyp
es: Tipo de Comida

# componentsChatNutritionAnalysisCardNutritionAnalysis
source: Nutrition Analysis
de: Nährwertanalyse
es: Análisis Nutricional

# componentsChatNutritionAnalysisCardServingSize
source: Serving Size
de: Portionsgröße
es: Tamaño de Porción

# componentsChatQuickActionsQuickActions
source: Quick Actions
de: Schnellaktionen
es: Acciones Rápidas

# componentsChatUserProfileCustomizationDialogEditUserProfile
source: Edit User Profile
de: Benutzerprofil bearbeiten
es: Editar Perfil de Usuario

# componentsChatUserProfileCustomizationDialogUsername
source: Username
de: Benutzername
es: Nombre de usuario

# componentsDishesDishCardDelete
source: Delete
de: Löschen
es: Eliminar

# componentsDishesDishCardEdit
source: Edit
de: Bearbeiten
es: Editar

# componentsDishesDishFormIngredientFormModalAddIngredient
source: Add Ingredient
de: Zutat hinzufügen
es: Agregar Ingrediente

# componentsDishesDishFormIngredientFormModalEditIngredient
source: Edit Ingredient
de: Zutat bearbeiten
es: Editar Ingrediente

# componentsDishesDishFormIngredientFormModalIngredientName
source: Ingredient Name
de: Zutatenname
es: Nombre del Ingrediente

# componentsDishesDishFormIngredientFormModalIngredientNamePlaceholder
source: Enter ingredient name
de: Zutatennamen eingeben
es: Ingrese nombre del ingrediente
