Repository: MrLappes/platepal-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es

# screensSettingsApiKeySettingsOpenAiApiKey
source: OpenAI API Key
de: OpenAI API-Schlüssel
es: Clave API de OpenAI

# screensSettingsApiKeySettingsPastedFromClipboard
source: Pasted from clipboard
de: Aus Zwischenablage eingefügt
es: Pegado desde portapapeles

# screensSettingsApiKeySettingsPasteFromClipboard
source: Paste from Clipboard
de: Aus Zwischenablage einfügen
es: Pegar desde portapapeles

# screensSettingsApiKeySettingsRemove
source: Remove
de: Entfernen
es: Eliminar

# screensSettingsApiKeySettingsRemoveApiKey
source: Remove API Key
de: API-Schlüssel entfernen
es: Eliminar clave API

# screensSettingsApiKeySettingsRemoveApiKeyConfirmation
source: Are you sure you want to remove your API key? This will disable AI features.
de: Sind Sie sicher, dass Sie Ihren API-Schlüssel entfernen möchten? Dies deaktiviert KI-Funktionen.
es: ¿Estás seguro de que quieres eliminar tu clave API? Esto desactivará las funciones de IA.

# screensSettingsApiKeySettingsSelectModel
source: Select Model
de: Modell auswählen
es: Seleccionar Modelo

# screensSettingsApiKeySettingsTestAndSaveApiKey
source: Test & Save API Key
de: API-Schlüssel testen & speichern
es: Probar y Guardar Clave API

# screensSettingsApiKeySettingsTestingApiKey
source: Testing API key...
de: API-Schlüssel wird getestet...
es: Probando clave API...

# screensSettingsApiKeySettingsUpdateApiKey
source: Update API Key
de: API-Schlüssel aktualisieren
es: Actualizar clave API

# screensSettingsChatAgentSettingsChatAgentDeepSearchSubtitle
source: Allow the agent to use deep search for more accurate answers
de: Erlaube dem Agenten, Deep Search für genauere Antworten zu verwenden
es: Permite que el agente use búsqueda profunda para respuestas más precisas

# screensSettingsChatAgentSettingsChatAgentDeepSearchTitle
source: Enable Deep Search
de: Deep Search aktivieren
es: Activar Búsqueda Profunda

# screensSettingsChatAgentSettingsChatAgentEnableSubtitle
source: Use the multi-step agent pipeline for chat
de: Verwende die mehrstufige Agenten-Pipeline für den Chat
es: Usa la canalización de agente de varios pasos para el chat

# screensSettingsChatAgentSettingsChatAgentEnableTitle
source: Enable Agent Mode
de: Agent-Modus aktivieren
es: Activar Modo Agente

# screensSettingsChatAgentSettingsChatAgentInfoDescription
source: Agent mode enables PlatePal's advanced multi-step reasoning pipeline for chat. This allows the assistant to analyze your query, gather context, and provide more accurate, explainable answers. Deep Search lets the agent use more data for even better results.
de: Der Agent-Modus aktiviert PlatePals fortschrittliche mehrstufige Denk-Pipeline für den Chat. So kann der Assistent deine Anfrage analysieren, Kontext sammeln und genauere, erklärbare Antworten liefern. Deep Search ermöglicht dem Agenten, noch mehr Daten für bessere Ergebnisse zu nutzen.
es: El modo agente activa la avanzada canalización de razonamiento de varios pasos de PlatePal para el chat. Esto permite que el asistente analice tu consulta, recopile contexto y proporcione respuestas más precisas y explicables. La Búsqueda Profunda permite al agente usar más datos para obtener mejores resultados.

# screensSettingsChatAgentSettingsChatAgentInfoTitle
source: What is Agent Mode?
de: Was ist der Agent-Modus?
es: ¿Qué es el Modo Agente?

# screensSettingsChatAgentSettingsChatAgentSettingsTitle
source: Chat Agent Settings
de: Chat-Agent Einstellungen
es: Configuración del Agente de Chat

# screensSettingsChatAgentSettingsChatSettingsSaved
source: Chat settings saved successfully
de: Chat-Einstellungen erfolgreich gespeichert
es: Configuración de chat guardada correctamente

# screensSettingsContributorsBuyMeCreatine
source: Buy Me Creatine
de: Kaufen Sie mir Kreatin
es: Cómprame creatina

# screensSettingsContributorsCheckGitHub
source: Check Out Our GitHub Repository
de: Schauen Sie sich unser GitHub-Repository an
es: Echa un vistazo a nuestro repositorio de GitHub

# screensSettingsContributorsContributorPlural
source: Contributors
de: Mitwirkende
es: Contribuidores

# screensSettingsContributorsContributorSingular
source: Contributor
de: Mitwirkender
es: Contribuidor

# screensSettingsContributorsContributorsThankYou
source: Thanks to everyone who has contributed to making PlatePal Tracker possible!
de: Danke an alle, die dazu beigetragen haben, PlatePal Tracker möglich zu machen!
es: ¡Gracias a todos los que han contribuido a hacer posible PlatePal Tracker!

# screensSettingsContributorsOpenSourceMessage
source: PlatePal Tracker is open source - join us on GitHub!
de: PlatePal Tracker ist Open Source - treten Sie uns auf GitHub bei!
es: PlatePal Tracker es de código abierto: ¡únete a nosotros en GitHub!

# screensSettingsContributorsSupportDevelopment
source: Support Development
de: Entwicklung unterstützen
es: Apoyar el desarrollo

# screensSettingsContributorsSupportMessage
source: You want to buy me my creatine? Your support is greatly appreciated but not at all mandatory.
de: Möchten Sie mir mein Kreatin kaufen? Ihre Unterstützung wird sehr geschätzt, ist aber keineswegs verpflichtend.
es: ¿Quieres comprarme mi creatina? Tu apoyo es muy apreciado pero no es para nada obligatorio.

# screensSettingsContributorsWantToContribute
source: Want to Contribute?
de: Möchten Sie mitwirken?
es: ¿Quieres contribuir?

# screensSettingsExportDataAllData
source: All Data
de: Alle Daten
es: Todos los Datos

# screensSettingsExportDataDishes
source: Dishes
de: Gerichte
es: Platos

# screensSettingsExportDataExportAsCsv
source: Export as CSV
de: Als CSV exportieren
es: Exportar como CSV

# screensSettingsExportDataExportAsJson
source: Export as JSON
de: Als JSON exportieren
es: Exportar como JSON

# screensSettingsExportDataExportedItemsCount
source: Exported {count} items
de: {count} Elemente exportiert
es: Se exportaron {count} elementos

# screensSettingsExportDataExportProgress
source: Exporting data...
de: Daten werden exportiert...
es: Exportando datos...

# screensSettingsExportDataMealLogs
source: Meal Logs
de: Mahlzeiten-Protokolle
es: Registros de Comidas

# screensSettingsExportDataNutritionGoalsData
source: Nutrition Goals
de: Ernährungsziele
es: Objetivos Nutricionales

# screensSettingsExportDataSelectDataToExport
source: Select data to export
de: Zu exportierende Daten auswählen
es: Seleccionar datos para exportar

# screensSettingsExportDataSupplements
source: Supplements
de: Nahrungsergänzungsmittel
es: Suplementos

# screensSettingsExportDataUserProfiles
source: User Profiles
de: Benutzerprofile
es: Perfiles de Usuario

# screensSettingsImportDataHowToHandleDuplicates
source: How to handle duplicates?
de: Wie sollen Duplikate behandelt werden?
es: ¿Cómo manejar duplicados?

# screensSettingsImportDataImportedItemsCount
source: Imported {count} items
de: {count} Elemente importiert
es: Se importaron {count} elementos

# screensSettingsImportDataImportFailed
source: Import failed
de: Import fehlgeschlagen
es: Error en la importación

# screensSettingsImportDataImportFromFile
source: Import from File
de: Aus Datei importieren
es: Importar desde Archivo

# screensSettingsImportDataImportProgress
source: Importing data...
de: Daten werden importiert...
es: Importando datos...

# screensSettingsImportDataMergeDuplicates
source: Merge Duplicates
de: Duplikate zusammenführen
es: Fusionar Duplicados

# screensSettingsImportDataOverwriteDuplicates
source: Overwrite Duplicates
de: Duplikate überschreiben
es: Sobrescribir Duplicados

# screensSettingsImportDataSelectDataToImport
source: Select data to import
de: Zu importierende Daten auswählen
es: Seleccionar datos para importar

# screensSettingsImportDataSelectFile
source: Select File
de: Datei auswählen
es: Seleccionar Archivo

# screensSettingsImportDataSkipDuplicates
source: Skip Duplicates
de: Duplikate überspringen
es: Omitir Duplicados

# screensSettingsImportProfileCompletionActivityLevel
source: Activity Level
de: Aktivitätslevel
es: Nivel de Actividad

# screensSettingsImportProfileCompletionAge
source: Age
de: Alter
es: Edad

# screensSettingsImportProfileCompletionAgeRange
source: Age must be between 13 and 120
de: Das Alter muss zwischen 13 und 120 liegen
es: La edad debe estar entre 13 y 120

# screensSettingsImportProfileCompletionBuildMuscle
source: Build Muscle
de: Muskeln aufbauen
es: Construir Músculo

# screensSettingsImportProfileCompletionEmail
source: Email
es: Correo Electrónico

# screensSettingsImportProfileCompletionExtraActive
source: Extra Active
de: Extrem aktiv
es: Extremadamente Activo

# screensSettingsImportProfileCompletionFemale
source: Female
de: Weiblich
es: Femenino

# screensSettingsImportProfileCompletionFitnessGoal
source: Fitness Goal
de: Fitnessziel
es: Objetivo de Fitness

# screensSettingsImportProfileCompletionGainWeight
source: Gain Weight
de: Gewicht zunehmen
es: Ganar Peso

# screensSettingsImportProfileCompletionGender
source: Gender
de: Geschlecht
es: Género

# screensSettingsImportProfileCompletionHeight
source: Height
de: Größe
es: Altura

# screensSettingsImportProfileCompletionHeightRange
source: Height must be between 100-250 cm
de: Die Größe muss zwischen 100-250 cm liegen
es: La altura debe estar entre 100-250 cm

# screensSettingsImportProfileCompletionInvalidEmail
source: Please enter a valid email address
de: Bitte geben Sie eine gültige E-Mail-Adresse ein
es: Por favor ingresa una dirección de correo válida

# screensSettingsImportProfileCompletionLightlyActive
source: Lightly Active
de: Leicht aktiv
es: Ligeramente Activo

# screensSettingsImportProfileCompletionLoseWeight
source: Lose Weight
de: Gewicht verlieren
es: Perder Peso

# screensSettingsImportProfileCompletionMaintainWeight
source: Maintain Weight
de: Gewicht halten
es: Mantener Peso

# screensSettingsImportProfileCompletionMale
source: Male
de: Männlich
es: Masculino

# screensSettingsImportProfileCompletionMetric
source: Metric (kg, cm)
de: Metrisch (kg, cm)
es: Métrico (kg, cm)

# screensSettingsImportProfileCompletionModeratelyActive
source: Moderately Active
de: Mäßig aktiv
es: Moderadamente Activo

# screensSettingsImportProfileCompletionName
source: Name
es: Nombre

# screensSettingsImportProfileCompletionOther
source: Other
de: Andere
es: Otro

# screensSettingsImportProfileCompletionPersonalInformation
source: Personal Information
de: Persönliche Informationen
es: Información Personal

# screensSettingsImportProfileCompletionPreferences
source: Preferences
de: Einstellungen
es: Preferencias

# screensSettingsImportProfileCompletionSedentary
source: Sedentary
de: Sesshaft
es: Sedentario

# screensSettingsImportProfileCompletionUnitSystem
source: Unit System
de: Einheitensystem
es: Sistema de Unidades

# screensSettingsImportProfileCompletionVeryActive
source: Very Active
de: Sehr aktiv
es: Muy Activo

# screensSettingsImportProfileCompletionWeight
source: Weight
de: Gewicht
es: Peso

# screensSettingsImportProfileCompletionWeightRange
source: Weight must be between 30-300 kg
de: Das Gewicht muss zwischen 30-300 kg liegen
es: El peso debe estar entre 30-300 kg

# screensSettingsImportProfileCompletionYears
source: years
de: Jahre
es: años

# screensSettingsMacroCustomizationDiscardChanges
source: Discard Changes
de: Änderungen verwerfen
es: Descartar Cambios

# screensSettingsMacroCustomizationMacroCustomization
source: Macro Customization
de: Makro-Anpassung
es: Personalización de Macros

# screensSettingsMacroCustomizationMacroCustomizationInfo
source: Customize your macro targets. All percentages must add up to 100%.
de: Passen Sie Ihre Makro-Ziele an. Alle Prozentsätze müssen sich zu 100% addieren.
es: Personaliza tus objetivos de macros. Todos los porcentajes deben sumar 100%.

# screensSettingsMacroCustomizationMacroTargetsUpdated
source: Macro targets updated successfully
de: Makro-Ziele erfolgreich aktualisiert
es: Objetivos de macros actualizados exitosamente

# screensSettingsMacroCustomizationResetToDefaults
source: Reset to Defaults
de: Auf Standard zurücksetzen
es: Restablecer por Defecto

# screensSettingsMacroCustomizationSaveChanges
source: Save Changes
de: Änderungen speichern
es: Guardar Cambios

# screensSettingsMacroCustomizationUnsavedChanges
source: Unsaved Changes
de: Nicht gespeicherte Änderungen
es: Cambios No Guardados

# screensSettingsMacroCustomizationUnsavedChangesMessage
source: You have unsaved changes. Do you want to save them before leaving?
de: Sie haben nicht gespeicherte Änderungen. Möchten Sie sie vor dem Verlassen speichern?
es: Tienes cambios no guardados. ¿Quieres guardarlos antes de salir?

# screensSettingsProfileSettingsAnalyzeTargets
source: Analyze Targets
de: Ziele analysieren
es: Analizar Objetivos

# screensSettingsProfileSettingsBmi
source: BMI
es: IMC

# screensSettingsProfileSettingsConnectToHealth
source: Connect to Health
de: Mit Gesundheitsdaten verbinden
es: Conectar con Salud

# screensSettingsProfileSettingsDangerZone
source: Danger Zone
de: Gefahrenzone
es: Zona de Peligro

# screensSettingsProfileSettingsDebugHealthData
source: Debug Health Data
de: Gesundheitsdaten debuggen
es: Depurar Datos de Salud

# screensSettingsProfileSettingsDisconnectHealth
source: Disconnect Health
de: Gesundheit trennen
es: Desconectar Salud

# screensSettingsProfileSettingsFitnessGoals
source: Fitness Goals
de: Fitnessziele
es: Objetivos de Fitness

# screensSettingsProfileSettingsHealthConnected
source: Health data connected
de: Gesundheitsdaten verbunden
es: Datos de salud conectados

# screensSettingsProfileSettingsHealthDataSync
source: Health Data Sync
de: Gesundheitsdaten-Synchronisation
es: Sincronización de Datos de Salud

# screensSettingsProfileSettingsHealthDisconnected
source: Health data not connected
de: Gesundheitsdaten nicht verbunden
es: Datos de salud no conectados

# screensSettingsProfileSettingsHealthNotAvailable
source: Health Data Not Available
de: Gesundheitsdaten Nicht Verfügbar
es: Datos de Salud No Disponibles

# screensSettingsProfileSettingsHealthNotAvailableMessage
source: Health data is not available on this device. Make sure you have Health Connect (Android) or Health app (iOS) installed and configured.
de: Gesundheitsdaten sind auf diesem Gerät nicht verfügbar. Stelle sicher, dass du Health Connect (Android) oder die Health-App (iOS) installiert und konfiguriert hast.
es: Los datos de salud no están disponibles en este dispositivo. Asegúrate de tener Health Connect (Android) o la app Salud (iOS) instalada y configurada.

# screensSettingsProfileSettingsHealthPermissionDenied
source: Health Permission Denied
de: Gesundheitsberechtigung Verweigert
es: Permiso de Salud Denegado

# screensSettingsProfileSettingsHealthPermissionDeniedMessage
source: To sync your health data, PlatePal needs access to your health information. You can grant permissions in your phone's settings.
de: Um deine Gesundheitsdaten zu synchronisieren, benötigt PlatePal Zugriff auf deine Gesundheitsinformationen. Du kannst Berechtigungen in den Einstellungen deines Telefons erteilen.
es: Para sincronizar tus datos de salud, PlatePal necesita acceso a tu información de salud. Puedes otorgar permisos en la configuración de tu teléfono.

# screensSettingsProfileSettingsHealthSyncFailed
source: Failed to sync health data
de: Synchronisation der Gesundheitsdaten fehlgeschlagen
es: Error al sincronizar datos de salud

# screensSettingsProfileSettingsHealthSyncSuccess
source: Health data synced successfully
de: Gesundheitsdaten erfolgreich synchronisiert
es: Datos de salud sincronizados exitosamente

# screensSettingsProfileSettingsProfileSettings
source: Profile Settings
de: Profil-Einstellungen
es: Configuración de Perfil

# screensSettingsProfileSettingsProfileUpdated
source: Profile updated successfully
de: Profil erfolgreich aktualisiert
es: Perfil actualizado exitosamente

# screensSettingsProfileSettingsResetApp
source: Reset App
de: App Zurücksetzen
es: Restablecer App

# screensSettingsProfileSettingsResetAppCancel
source: Cancel
de: Abbrechen
es: Cancelar

# screensSettingsProfileSettingsResetAppConfirm
source: Yes, Delete Everything
de: Ja, Alles Löschen
es: Sí, Eliminar Todo

# screensSettingsProfileSettingsResetAppDescription
source: This will permanently delete ALL your data including: • Your profile information • All meal logs and nutrition data • All preferences and settings • All stored information This action cannot be undone. Are you sure you want to continue?
de: Dies wird ALLE Ihre Daten dauerhaft löschen, einschließlich: • Ihre Profilinformationen • Alle Mahlzeitenprotokolle und Ernährungsdaten • Alle Einstellungen und Präferenzen • Alle gespeicherten Informationen Diese Aktion kann nicht rückgängig gemacht werden. Sind Sie sicher, dass Sie fortfahren möchten?
es: Esto eliminará permanentemente TODOS tus datos incluyendo: • Tu información de perfil • Todos los registros de comidas y datos nutricionales • Todas las preferencias y configuraciones • Toda la información almacenada Esta acción no se puede deshacer. ¿Estás seguro de que quieres continuar?

# screensSettingsProfileSettingsResetAppError
source: Failed to reset application data
de: Fehler beim Zurücksetzen der Anwendungsdaten
es: Error al restablecer los datos de la aplicación

# screensSettingsProfileSettingsResetAppSuccess
source: Application data has been reset successfully
de: Anwendungsdaten wurden erfolgreich zurückgesetzt
es: Los datos de la aplicación se han restablecido exitosamente

# screensSettingsProfileSettingsResetAppTitle
source: Reset Application Data
de: Anwendungsdaten Zurücksetzen
es: Restablecer Datos de la Aplicación

# screensSettingsProfileSettingsSyncHealthData
source: Sync Health Data
de: Gesundheitsdaten synchronisieren
es: Sincronizar Datos de Salud

# screensSettingsProfileSettingsTargetWeight
source: Target Weight
de: Zielgewicht
es: Peso Objetivo

# screensSettingsStatisticsAllTime
source: All Time
de: Alle Zeit
es: Todo el Tiempo

# screensSettingsStatisticsBmiHistory
source: BMI History
de: BMI-Verlauf
es: Historial de IMC

# screensSettingsStatisticsBmiObese
source: Obese
de: Adipös
es: Obeso

# screensSettingsStatisticsBmiOverweight
source: Overweight
de: Übergewicht
es: Sobrepeso

# screensSettingsStatisticsBmiStatsTip
source: Body Mass Index (BMI) is calculated from your weight and height measurements.
de: Der Body Mass Index (BMI) wird aus Ihren Gewichts- und Größenmessungen berechnet.
es: El Índice de Masa Corporal (IMC) se calcula a partir de tus medidas de peso y altura.

# screensSettingsStatisticsBmiUnderweight
source: Underweight
de: Untergewicht
es: Bajo peso

# screensSettingsStatisticsBodyFat
source: Body Fat
de: Körperfett
es: Grasa Corporal

# screensSettingsStatisticsBodyFatHistory
source: Body Fat History
de: Körperfett-Verlauf
es: Historial de Grasa Corporal

# screensSettingsStatisticsBodyFatStatsTip
source: Body fat percentage helps track your body composition beyond just weight.
de: Der Körperfettanteil hilft dabei, Ihre Körperzusammensetzung über das Gewicht hinaus zu verfolgen.
es: El porcentaje de grasa corporal ayuda a rastrear tu composición corporal más allá del peso.

# screensSettingsStatisticsBulking
source: Bulking
de: Aufbau
es: Volumen

# screensSettingsStatisticsCalorieBalanceTip
source: Track your actual calorie balance using health data. Green = maintenance, Blue = deficit, Orange = surplus.
de: Verfolgen Sie Ihre tatsächliche Kalorienbilanz mit Gesundheitsdaten. Grün = Erhaltung, Blau = Defizit, Orange = Überschuss.
es: Rastrea tu balance calórico real usando datos de salud. Verde = mantenimiento, Azul = déficit, Naranja = superávit.

# screensSettingsStatisticsCalorieBalanceTitle
source: Calorie Balance (Intake vs Expenditure)
de: Kalorienbilanz (Aufnahme vs. Verbrauch)
es: Balance Calórico (Ingesta vs Gasto)

# screensSettingsStatisticsCalorieIntakeHistory
source: Calorie Intake vs Maintenance
de: Kalorienaufnahme vs. Erhaltung
es: Ingesta de Calorías vs Mantenimiento

# screensSettingsStatisticsCalorieStatsTip
source: Compare your daily calorie intake to your maintenance calories. Green indicates maintenance, blue is cutting phase, orange is bulking phase.
de: Vergleichen Sie Ihre tägliche Kalorienaufnahme mit Ihren Erhaltungskalorien. Grün zeigt Erhaltung, Blau ist Definitionsphase, Orange ist Aufbauphase.
es: Compara tu ingesta diaria de calorías con tus calorías de mantenimiento. Verde indica mantenimiento, azul es fase de corte, naranja es fase de volumen.

# screensSettingsStatisticsCannotCalculateBmiFromData
source: Cannot calculate BMI from available data
de: BMI kann aus verfügbaren Daten nicht berechnet werden
es: No se puede calcular el IMC con los datos disponibles

# screensSettingsStatisticsCutting
source: Cutting
de: Definition
es: Corte

# screensSettingsStatisticsErrorLoadingData
source: Error loading data
de: Fehler beim Laden der Daten
es: Error al cargar datos

# screensSettingsStatisticsEstimatedBalance
source: Estimated Balance
de: Geschätzte Bilanz
es: Balance Estimado

# screensSettingsStatisticsExtremeDeficitWarning
source: Warning: Frequent extreme calorie deficits may slow metabolism and cause muscle loss.
de: Warnung: Häufige extreme Kaloriendefizite können den Stoffwechsel verlangsamen und Muskelverlust verursachen.
es: Advertencia: Los déficits calóricos extremos frecuentes pueden ralentizar el metabolismo y causar pérdida muscular.

# screensSettingsStatisticsGenerateTestData
source: Generate Test Data
de: Testdaten Generieren
es: Generar Datos de Prueba

# screensSettingsStatisticsHealthDataActive
source: Using your health app data to provide more accurate deficit/surplus analysis.
de: Ihre Gesundheits-App-Daten werden für eine genauere Defizit-/Überschussanalyse verwendet.
es: Usando los datos de tu aplicación de salud para proporcionar un análisis más preciso de déficit/superávit.

# screensSettingsStatisticsHealthDataAlert
source: Health Data Alert: {days} day(s) with very large calorie deficits (>1000 cal) based on actual expenditure.
de: Gesundheitsdaten-Warnung: {days} Tag(e) mit sehr großen Kaloriendefiziten (>1000 kcal) basierend auf dem tatsächlichen Verbrauch.
es: Alerta de Datos de Salud: {days} día(s) con déficits calóricos muy grandes (>1000 cal) basados en el gasto real.

# screensSettingsStatisticsHealthDataInactive
source: Enable health data sync in Profile Settings for more accurate analysis.
de: Aktivieren Sie die Gesundheitsdatensynchronisation in den Profileinstellungen für eine genauere Analyse.
es: Activa la sincronización de datos de salud en Configuración de Perfil para un análisis más preciso.

# screensSettingsStatisticsHealthDataIntegration
source: Health Data Integration
de: Gesundheitsdaten-Integration
es: Integración de Datos de Salud

# screensSettingsStatisticsInconsistentDeficitWarning
source: Warning: Your calorie deficit varies significantly day-to-day (variance: {variance} cal). Consider more consistent intake.
de: Warnung: Ihr Kaloriendefizit variiert erheblich von Tag zu Tag (Varianz: {variance} kcal). Erwägen Sie eine konsistentere Aufnahme.
es: Advertencia: Tu déficit calórico varía significativamente día a día (varianza: {variance} cal). Considera una ingesta más consistente.

# screensSettingsStatisticsLastMonth
source: Last Month
de: Letzter Monat
es: Último Mes

# screensSettingsStatisticsLastSixMonths
source: Last 6 Months
de: Letzte 6 Monate
es: Últimos 6 Meses

# screensSettingsStatisticsLastThreeMonths
source: Last 3 Months
de: Letzte 3 Monate
es: Últimos 3 Meses

# screensSettingsStatisticsLastWeek
source: Last Week
de: Letzte Woche
es: Última Semana

# screensSettingsStatisticsLastYear
source: Last Year
de: Letztes Jahr
es: Último Año

# screensSettingsStatisticsMaintenance
source: Maintenance
de: Erhaltung
es: Mantenimiento

# screensSettingsStatisticsNoBmiDataAvailable
source: No BMI data available
de: Keine BMI-Daten verfügbar
es: No hay datos de IMC disponibles
