Repository: MrLappes/platepal-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es

# screensSettingsStatisticsNoBodyFatDataAvailable
source: No body fat data available
de: Keine Körperfettdaten verfügbar
es: No hay datos de grasa corporal disponibles

# screensSettingsStatisticsNoCalorieDataAvailable
source: No calorie data available
de: Keine Kaloriendaten verfügbar
es: No hay datos de calorías disponibles

# screensSettingsStatisticsNotEnoughDataTitle
source: Not Enough Data
de: Nicht genügend Daten
es: No Hay Suficientes Datos

# screensSettingsStatisticsNoWeightDataAvailable
source: No weight data available
de: Keine Gewichtsdaten verfügbar
es: No hay datos de peso disponibles

# screensSettingsStatisticsPhaseAnalysis
source: Phase Analysis
de: Phasenanalyse
es: Análisis de Fase

# screensSettingsStatisticsRealData
source: Real Data
de: Echte Daten
es: Datos Reales

# screensSettingsStatisticsRefresh
source: Refresh
de: Aktualisieren
es: Actualizar

# screensSettingsStatisticsStatistics
source: Statistics
de: Statistiken
es: Estadísticas

# screensSettingsStatisticsStatisticsEmptyDescription
source: We need at least a week of data to show meaningful statistics. Keep tracking your metrics to see trends over time.
de: Wir benötigen mindestens eine Woche Daten, um aussagekräftige Statistiken zu zeigen. Verfolgen Sie weiter Ihre Messwerte, um Trends über die Zeit zu sehen.
es: Necesitamos al menos una semana de datos para mostrar estadísticas significativas. Sigue rastreando tus métricas para ver tendencias con el tiempo.

# screensSettingsStatisticsTestDataDescription
source: For demonstration purposes, you can generate sample data to see how the statistics look.
de: Zu Demonstrationszwecken können Sie Beispieldaten generieren, um zu sehen, wie die Statistiken aussehen.
es: Para fines de demostración, puedes generar datos de muestra para ver cómo se ven las estadísticas.

# screensSettingsStatisticsTimeRange
source: Time Range
de: Zeitbereich
es: Rango de Tiempo

# screensSettingsStatisticsTryAgain
source: Try Again
de: Erneut versuchen
es: Intentar de Nuevo

# screensSettingsStatisticsUpdateMetricsNow
source: Update Metrics Now
de: Messwerte jetzt aktualisieren
es: Actualizar Métricas Ahora

# screensSettingsStatisticsVeryHighCalorieNotice
source: Notice: {days} day(s) with very high calorie intake (>1000 cal above maintenance).
de: Hinweis: {days} Tag(e) mit sehr hoher Kalorienaufnahme (>1000 kcal über dem Erhaltungsbedarf).
es: Aviso: {days} día(s) con ingesta calórica muy alta (>1000 cal por encima del mantenimiento).

# screensSettingsStatisticsVeryLowCalorieWarning
source: Warning: {days} day(s) with extremely low calorie intake (<1000 cal). This may be unhealthy.
de: Warnung: {days} Tag(e) mit extrem niedriger Kalorienaufnahme (<1000 kcal). Dies kann ungesund sein.
es: Advertencia: {days} día(s) con ingesta calórica extremadamente baja (<1000 cal). Esto puede ser poco saludable.

# screensSettingsStatisticsVsExpenditure
source: vs expenditure
de: vs. Verbrauch
es: vs gasto

# screensSettingsStatisticsWeeklyAverage
source: Weekly Average
de: Wöchentlicher Durchschnitt
es: Promedio Semanal

# screensSettingsStatisticsWeightHistory
source: Weight History
de: Gewichtsverlauf
es: Historial de Peso

# screensSettingsStatisticsWeightStatsTip
source: The graph shows median weekly weight to account for daily fluctuations due to water weight.
de: Das Diagramm zeigt das wöchentliche Mediangewicht, um tägliche Schwankungen durch Wassergewicht zu berücksichtigen.
es: El gráfico muestra el peso promedio semanal para tener en cuenta las fluctuaciones diarias debido al peso del agua.

# utilsLinkHandlerAvailable
source: Available
de: Verfügbar
es: Disponible

# utilsLinkHandlerCouldNotOpenUrl
source: Could not open {url}
de: Konnte {url} nicht öffnen
es: No se pudo abrir {url}

# utilsLinkHandlerNotAvailable
source: Not available
de: Nicht verfügbar
es: No disponible

# utilsLinkHandlerOpeningLink
source: Opening Buy Me Creatine page...
de: Öffne Buy Me Creatine Seite...
es: Abriendo página de Buy Me Creatine...

# componentsCalendarMacroSummaryCompactCarbs
source: Carbs
de: Kohlenh.

# componentsCalendarMacroSummaryCompactFat
source: Fat
de: Fett
