Repository: MrLappes/platepal-tracker-flutter
Catalog: lib/l10n/app_*.arb
Languages: de, es

# componentsDishesDishFormIngredientFormModalNutritionInformation
source: Nutrition Information
de: Nährwertinformationen
es: Información Nutricional

# componentsDishesDishFormIngredientFormModalNutritionPer100g
source: Nutrition per 100g
de: Nährwerte pro 100g
es: Nutrición por 100g

# componentsDishesDishFormIngredientFormModalPleaseEnterIngredientName
source: Please enter an ingredient name
de: Bitte geben Sie einen Zutatennamen ein
es: Por favor ingresa un nombre para el ingrediente

# componentsDishesDishFormIngredientFormModalPleaseEnterQuantity
source: Please enter a quantity
de: Bitte geben Sie eine Menge ein
es: Por favor ingrese una cantidad

# componentsDishesDishFormIngredientFormModalPleaseEnterValidNumber
source: Please enter a valid number
de: Bitte geben Sie eine gültige Zahl ein
es: Por favor ingrese un número válido

# componentsDishesDishFormIngredientFormModalQuantity
source: Quantity
de: Menge
es: Cantidad

# componentsDishesDishFormIngredientFormModalQuantityPlaceholder
source: Enter quantity
es: Ingrese cantidad

# componentsDishesDishFormSmartNutritionCardNutritionalInformation
source: Nutritional Information
de: Nährwertinformationen
es: Información Nutricional

# componentsModalsDishLogModalAddNotes
source: Add notes (optional)
de: Notizen hinzufügen (optional)
es: Agregar notas (opcional)

# componentsModalsDishLogModalBreakfast
source: Breakfast
de: Frühstück
es: Desayuno

# componentsModalsDishLogModalCalculatedNutrition
source: Calculated Nutrition
de: Berechnete Nährwerte
es: Nutrición Calculada

# componentsModalsDishLogModalDinner
source: Dinner
de: Abendessen
es: Cena

# componentsModalsDishLogModalDishLoggedSuccessfully
source: Dish logged successfully!
de: Gericht erfolgreich protokolliert!
es: ¡Plato registrado exitosamente!

# componentsModalsDishLogModalErrorLoggingDish
source: There was an error logging the dish
de: Fehler beim eintragen des Gerichtes
es: Error al registrar el plato

# componentsModalsDishLogModalLogDishTitle
source: Log Dish
de: Gericht eintragen
es: Registrar Plato

# componentsModalsDishLogModalLunch
source: Lunch
de: Mittagessen
es: Almuerzo

# componentsModalsDishLogModalNotes
source: Notes
de: Notizen
es: Notas

# componentsModalsDishLogModalPortionSize
source: Portion Size
de: Portionsgröße
es: Tamaño de Porción

# componentsModalsDishLogModalSelectDate
source: Select Date
de: Datum auswählen
es: Seleccionar Fecha

# componentsModalsDishLogModalSelectMealType
source: Select Meal Type
de: Mahlzeitentyp auswählen
es: Seleccionar Tipo de Comida

# componentsModalsDishLogModalSnack
source: Snack
es: Merienda

# componentsScannerBarcodeScannerBarcodeScanner
source: Barcode Scanner
es: Escáner de código de barras

# componentsScannerBarcodeScannerErrorScanningBarcode
source: Error scanning barcode: {error}
de: Fehler beim Scannen des Barcodes
es: Error al escanear el código de barras

# componentsScannerBarcodeScannerOpenSettings
source: Open Settings
de: Einstellungen Öffnen
es: Abrir Configuración

# componentsScannerBarcodeScannerProductNotFound
source: Product not found
de: Produkt nicht gefunden
es: Producto no encontrado

# componentsScannerBarcodeScannerScanBarcodeToAddProduct
source: Scan a barcode to quickly add products
de: Barcode scannen, um Produkt hinzuzufügen
es: Escanea el código de barras para agregar producto

# componentsScannerBarcodeScannerScanningBarcode
source: Scanning barcode...
de: Barcode wird gescannt...
es: Escaneando código de barras...

# componentsScannerProductSearchErrorSearchingProduct
source: Error searching for product: {error}
de: Fehler bei der Produktsuche
es: Error al buscar el producto

# componentsScannerProductSearchLoadMore
source: Loard more
de: Mehr laden
es: Cargar más

# componentsScannerProductSearchLocalDishes
source: Local Dishes
de: Lokale Gerichte
es: Platos locales

# componentsScannerProductSearchLocalIngredients
source: Local ingredients
de: Lokale Zutaten
es: Ingredientes locales

# componentsScannerProductSearchNoProductsFound
source: No products found
de: Keine Produkte gefunden
es: No se encontraron productos

# componentsScannerProductSearchProductSearch
source: Product Search
de: Produktsuche
es: Búsqueda de producto

# componentsScannerProductSearchSearchProducts
source: Search products...
de: Produkte suchen
es: Buscar productos

# componentsSharedErrorDisplayRetry
source: Retry
de: Wiederholen
es: Reintentar

# componentsUiCustomTabBarCalendar
source: Calendar
de: Kalender
es: Calendario

# componentsUiCustomTabBarMeals
source: Meals
de: Mahlzeiten
es: Comidas

# componentsUiCustomTabBarMenu
source: Menu
de: Menü
es: Menú

# providersChatProviderAiThinking
source: AI is thinking...
de: KI denkt nach...
es: La IA está pensando...

# providersChatProviderTestChatResponse
source: Thanks for trying PlatePal! This is a test response to show you how our AI assistant works. To get real nutrition advice and meal suggestions, please configure your OpenAI API key in settings.
de: Danke, dass Sie PlatePal ausprobieren! Dies ist eine Testantwort, um Ihnen zu zeigen, wie unser KI-Assistent funktioniert. Um echte Ernährungsberatung und Mahlzeitenvorschläge zu erhalten, konfigurieren Sie bitte Ihren OpenAI API-Schlüssel in den Einstellungen.
es: ¡Gracias por probar PlatePal! Esta es una respuesta de prueba para mostrarte cómo funciona nuestro asistente IA. Para obtener consejos nutricionales reales y sugerencias de comidas, por favor configura tu clave API de OpenAI en ajustes.

# providersChatProviderTestChatWelcome
source: This is test mode! I can help you explore PlatePal's features. Try asking me about nutrition, meal planning, or food recommendations.
de: Dies ist der Testmodus! Ich kann Ihnen helfen, die Funktionen von PlatePal zu erkunden. Versuchen Sie, mich nach Ernährung, Essensplanung oder Lebensmittelempfehlungen zu fragen.
es: ¡Este es el modo de prueba! Puedo ayudarte a explorar las características de PlatePal. Intenta preguntarme sobre nutrición, planificación de comidas o recomendaciones de alimentos.

# providersChatProviderWelcomeToChat
source: Welcome to your AI nutrition assistant! Ask me anything about meals, nutrition, or your fitness goals.
de: Willkommen bei Ihrem KI-Ernährungsassistenten! Fragen Sie mich alles über Mahlzeiten, Ernährung oder Ihre Fitnessziele.
es: ¡Bienvenido a tu asistente nutricional IA! Pregúntame cualquier cosa sobre comidas, nutrición o tus objetivos de fitness.

# screensCalendarAiNutritionTip
source: AI Nutrition Tip
de: KI Ernährungstipp
es: Consejo de Nutrición IA

# screensCalendarConfigureApiKeyForAiTips
source: Please configure your OpenAI API key in settings to use AI tips
de: Bitte OpenAI-API-Schlüssel in den Einstellungen konfigurieren, um KI-Tipps zu nutzen
es: Configura tu clave de OpenAI en ajustes para usar consejos de IA

# screensCalendarDeleteLog
source: Delete Log
de: Protokoll löschen
es: Eliminar Registro

# screensCalendarDeleteLogConfirmation
source: Are you sure you want to delete this logged meal?
de: Sind Sie sicher, dass Sie diese protokollierte Mahlzeit löschen möchten?
es: ¿Está seguro de que desea eliminar esta comida registrada?

# screensCalendarFailedToDeleteMealLog
source: Failed to delete meal log
de: Löschen des Mahlzeit-Protokolls fehlgeschlagen
es: Error al eliminar el registro de comida

# screensCalendarFailedToGetAiTip
source: Failed to get AI tip. Please try again.
de: Fehler beim Abrufen des KI-Tipps. Bitte erneut versuchen.
es: Error al obtener el consejo de IA. Inténtalo de nuevo.

# screensCalendarMealLogDeletedSuccessfully
source: Meal log deleted successfully
de: Mahlzeit-Protokoll erfolgreich gelöscht
es: Registro de comida eliminado exitosamente

# screensChatChatAssistant
source: AI Chat Assistant
de: KI-Chat-Assistent
es: Asistente de Chat IA

# screensChatChatCleared
source: Chat history cleared
de: Chat-Verlauf gelöscht
es: Historial del chat eliminado

# screensChatClearChat
source: Clear Chat
de: Chat löschen
es: Limpiar Chat

# screensChatClearChatConfirmation
source: Are you sure you want to clear the chat history? This action cannot be undone.
de: Sind Sie sicher, dass Sie den Chat-Verlauf löschen möchten? Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Estás seguro de que quieres limpiar el historial del chat? Esta acción no se puede deshacer.

# screensChatConfigureApiKeyButton
source: Configure API Key
de: API-Schlüssel konfigurieren
es: Configurar Clave API

# screensChatConfigureApiKeyToUseChat
source: Please configure your OpenAI API key in settings to use the AI chat assistant.
de: Bitte konfigurieren Sie Ihren OpenAI API-Schlüssel in den Einstellungen, um den KI-Chat-Assistenten zu verwenden.
es: Por favor configura tu clave API de OpenAI en ajustes para usar el asistente de chat IA.

# screensChatLoading
source: Loading...
de: Wird geladen...
es: Cargando...

# screensChatNoApiKeyConfigured
source: No API key configured
de: Kein API-Schlüssel konfiguriert
es: No hay clave API configurada

# screensChatReloadApiKeyButton
source: Reload API Key
de: API-Schlüssel neu laden
es: Recargar Clave API

# screensDishCreateBasicInfo
source: Basic Information
de: Grundinformationen
es: Información Básica

# screensDishCreateCamera
source: Camera
de: Kamera
es: Cámara

# screensDishCreateCategory
source: Category
de: Kategorie
es: Categoría

# screensDishCreateConfirmDeleteIngredient
source: Are you sure you want to delete this ingredient?
de: Sind Sie sicher, dass Sie diese Zutat löschen möchten?
es: ¿Está seguro de que desea eliminar este ingrediente?

# screensDishCreateCreateDish
source: Create Dish
de: Gericht erstellen
es: Crear Plato

# screensDishCreateDeleteIngredient
source: Delete Ingredient
de: Zutat löschen
es: Eliminar Ingrediente

# screensDishCreateDescription
source: Description
de: Beschreibung
es: Descripción

# screensDishCreateDescriptionPlaceholder
source: Enter description (optional)
de: Beschreibung eingeben
es: Ingrese la descripción (opcional)

# screensDishCreateDishCreatedSuccessfully
source: Dish created successfully
de: Gericht erfolgreich erstellt
es: Plato creado exitosamente

# screensDishCreateDishNamePlaceholder
source: Enter dish name
de: Gerichtnamen eingeben
es: Ingrese el nombre del plato

# screensDishCreateDishUpdatedSuccessfully
source: Dish updated successfully
de: Gericht erfolgreich aktualisiert
es: Plato actualizado exitosamente

# screensDishCreateEditDish
source: Edit Dish
de: Gericht bearbeiten
es: Editar Plato

# screensDishCreateErrorSavingDish
source: Error saving dish
de: Fehler beim Speichern des Gerichts
es: Error al guardar el plato

# screensDishCreateFavorite
source: Favorite
de: Favorit
es: Favoritos

# screensDishCreateGallery
source: Gallery
de: Galerie
es: Galería

# screensDishCreateIngredientDeleted
source: Ingredient deleted
de: Zutat gelöscht
es: Ingrediente eliminado

# screensDishCreateMarkAsFavorite
source: Mark as favorite dish
de: Als Favorit markieren
es: Marcar como plato favorito

# screensDishCreateNoIngredientsAdded
source: No ingredients added yet
de: Keine Zutaten hinzugefügt
es: No se han agregado ingredientes aún

# screensDishCreateNutritionRecalculated
source: Nutrition recalculated from ingredients
de: Nährwerte neu berechnet
es: Nutrición recalculada desde ingredientes

# screensDishCreateOptions
source: Options
de: Optionen
es: Opciones

# screensDishCreatePleaseEnterDishName
source: Please enter a dish name
de: Bitte geben Sie einen Gerichtnamen ein
es: Por favor ingresa un nombre para el plato

# screensDishCreateProductAddedSuccessfully
source: Product added successfully
de: Produkt erfolgreich hinzugefügt
es: Producto agregado exitosamente

# screensDishCreateRemoveImage
source: Remove image
de: Bild entfernen
es: Quitar imagen

# screensDishCreateSaveDish
source: Save Dish
de: Gericht speichern
es: Guardar Plato

# screensHomeWelcomeToPlatePalTracker
source: Welcome to PlatePal Tracker
de: Willkommen bei PlatePal Tracker
es: Bienvenido a PlatePal Tracker

# screensMealsAddedToFavorites
source: Added to favorites
de: Zu Favoriten hinzugefügt
es: Agregado a favoritos

# screensMealsAddMeal
source: Add Meal
de: Mahlzeit hinzufügen
es: Agregar Comida

# screensMealsAddToFavorites
source: Add to Favorites
de: Zu Favoriten hinzufügen
es: Agregar a Favoritos

# screensMealsAllCategories
source: All Categories
de: Alle Kategorien
es: Todas las Categorías

# screensMealsCreateFirstDish
source: Create your first dish to get started
de: Erstes Gericht erstellen
es: Crea tu primer plato para comenzar

# screensMealsDeleteDish
source: Delete Dish
de: Gericht löschen
es: Eliminar Plato

# screensMealsDeleteDishConfirmation
source: Are you sure you want to delete "{dishName}"?
de: Sind Sie sicher, dass Sie "{dishName}" löschen möchten?
es: ¿Estás seguro de que quieres eliminar "{dishName}"?

# screensMealsDishDeletedSuccessfully
source: Dish deleted successfully
de: Gericht erfolgreich gelöscht
es: Plato eliminado exitosamente

# screensMealsErrorLoadingDishes
source: Error loading dishes
de: Fehler beim Laden der Gerichte
es: Error al cargar los platos

# screensMealsErrorUpdatingDish
source: Error updating dish
de: Fehler beim Aktualisieren des Gerichts
es: Error al actualizar el plato

# screensMealsFailedToDeleteDish
source: Failed to delete dish
de: Gericht konnte nicht gelöscht werden
es: Error al eliminar el plato

# screensMealsNoDishesCreated
source: No dishes created yet
de: Noch keine Gerichte erstellt
es: No se han creado platos aún

# screensMealsNoDishesFound
source: No dishes found
de: Keine Gerichte gefunden
es: No se encontraron platos

# screensMealsRemovedFromFavorites
source: Removed from favorites
de: Aus Favoriten entfernt
es: Removido de favoritos

# screensMealsRemoveFromFavorites
source: Remove from Favorites
de: Aus Favoriten entfernen
es: Remover de Favoritos

# screensMealsSearchDishes
source: Search dishes...
de: Gerichte suchen
es: Buscar platos...

# screensMealsTryAdjustingSearch
source: Try adjusting your search terms
de: Versuchen Sie, Ihre Suche anzupassen
es: Intenta ajustar tus términos de búsqueda

# screensMenuAbout
source: About
de: Über uns
es: Acerca de

# screensMenuAiFeatures
source: AI & Features
de: KI & Funktionen
es: IA y Características

# screensMenuApiKeySettings
source: API Key Settings
de: API-Schlüssel Einstellungen
es: Configuración de Clave API

# screensMenuAppearance
source: Appearance
de: Erscheinungsbild
es: Apariencia

# screensMenuChatAgentOptions
source: Chat Agent Options
de: Chat-Agent Optionen
es: Opciones de Agente de Chat

# screensMenuConfigureApiKey
source: Configure your OpenAI API key
de: Konfigurieren Sie Ihren OpenAI API-Schlüssel
es: Configura tu clave API de OpenAI

# screensMenuContributors
source: Contributors
de: Mitwirkende
es: Contribuidores

# screensMenuCurrentStats
source: Current Stats
de: Aktuelle Statistiken
es: Estadísticas Actuales

# screensMenuDark
source: Dark
de: Dunkel
es: Oscuro

# screensMenuDataManagement
source: Data Management
de: Datenverwaltung
es: Gestión de Datos

# screensMenuEditPersonalInfo
source: Edit your personal information
de: Bearbeiten Sie Ihre persönlichen Informationen
es: Edita tu información personal

# screensMenuEnableAgentModeDeepSearch
source: Enable agent mode, deep search, and more
de: Agent-Modus, Deep Search und mehr aktivieren
es: Habilitar modo agente, búsqueda profunda y más

# screensMenuExportData
source: Export Data
de: Daten exportieren
es: Exportar Datos

# screensMenuExportMealData
source: Export your meal data
de: Exportieren Sie Ihre Mahlzeitdaten
es: Exporta tus datos de comidas

# screensMenuImportData
source: Import Data
de: Daten importieren
es: Importar Datos

# screensMenuImportMealDataBackup
source: Import meal data from backup
de: Importieren Sie Mahlzeitdaten aus der Sicherung
es: Importa datos de comidas desde respaldo

# screensMenuInformation
source: Information
de: Informationen
es: Información

# screensMenuLanguage
source: Language
de: Sprache
es: Idioma

# screensMenuLearnMorePlatePal
source: Learn more about PlatePal
de: Erfahren Sie mehr über PlatePal
es: Aprende más sobre PlatePal

# screensMenuLight
source: Light
de: Hell
es: Claro

# screensMenuMadeBy
source: Made by MrLappes
de: Erstellt von MrLappes
es: Hecho por MrLappes

# screensMenuNutritionGoals
source: Nutrition Goals
de: Ernährungsziele
es: Objetivos Nutricionales

# screensMenuProfile
source: Profile
de: Profil
es: Perfil

# screensMenuSetNutritionTargets
source: Set your daily nutrition targets
de: Legen Sie Ihre täglichen Ernährungsziele fest
es: Establece tus objetivos nutricionales diarios

# screensMenuSystem
source: System
es: Sistema

# screensMenuTheme
source: Theme
de: Design
es: Tema

# screensMenuUserProfile
source: User Profile
de: Benutzerprofil
es: Perfil de Usuario

# screensMenuViewContributors
source: View project contributors
de: Projektmitwirkende anzeigen
es: Ver contribuidores del proyecto

# screensMenuViewStatistics
source: View Statistics
de: Statistiken anzeigen
es: Ver Estadísticas

# screensSettingsAboutAboutAppTitle
source: About the App
de: Über uns
es: Acerca de la Aplicación

# screensSettingsAboutAboutDescription
source: PlatePal Tracker was created to provide a privacy-focused, open-source alternative to expensive nutrition tracking apps. We believe in putting control in your hands with no subscriptions, no ads, and no data collection.
de: PlatePal Tracker wurde entwickelt, um eine datenschutzorientierte, quelloffene Alternative zu teuren Ernährungs-Tracking-Apps zu bieten. Wir glauben daran, die Kontrolle in Ihre Hände zu legen - ohne Abonnements, ohne Werbung und ohne Datensammlung.
es: PlatePal Tracker fue creado para proporcionar una alternativa de código abierto y centrada en la privacidad a las costosas aplicaciones de seguimiento nutricional. Creemos en poner el control en tus manos sin suscripciones, sin anuncios y sin recopilación de datos.

# screensSettingsAboutAppMotto
source: Made by gym guys for gym guys that hate paid apps
de: Von Sportlern für Sportler gemacht, die kostenpflichtige Apps hassen
es: Hecho por deportistas para deportistas que odian las aplicaciones de pago

# screensSettingsAboutCodersMessage
source: Coders shouldn't have to pay
de: Programmierer sollten nicht bezahlen müssen
es: Los programadores no deberían tener que pagar

# screensSettingsAboutDataStaysOnDevice
source: Your data stays on your device
de: Ihre Daten bleiben auf Ihrem Gerät
es: Tus datos permanecen en tu dispositivo

# screensSettingsAboutFreeOpenSource
source: 100% free and open source
de: 100% kostenlos und quelloffen
es: 100% gratuito y de código abierto

# screensSettingsAboutUseOwnAiKey
source: Use your own AI key for full control
de: Verwenden Sie Ihren eigenen KI-Schlüssel für volle Kontrolle
es: Usa tu propia clave de IA para control total

# screensSettingsAboutWhyPlatePal
source: Why PlatePal?
de: Warum PlatePal?
es: ¿Por qué PlatePal?

# screensSettingsApiKeySettingsAboutOpenAiApiKey
source: About OpenAI API Key
de: Über OpenAI API-Schlüssel
es: Acerca de la clave API de OpenAI

# screensSettingsApiKeySettingsAiFeaturesEnabled
source: AI features are enabled
de: KI-Funktionen sind aktiviert
es: Las funciones de IA están habilitadas

# screensSettingsApiKeySettingsApiKeyBulletPoints
source: • Get your API key from platform.openai.com • Your key is stored locally on your device • Usage charges apply directly to your OpenAI account
de: • Holen Sie sich Ihren API-Schlüssel von platform.openai.com • Ihr Schlüssel wird lokal auf Ihrem Gerät gespeichert • Nutzungsgebühren werden direkt Ihrem OpenAI-Konto belastet
es: • Obtén tu clave API desde platform.openai.com • Tu clave se almacena localmente en tu dispositivo • Los cargos por uso se aplican directamente a tu cuenta de OpenAI

# screensSettingsApiKeySettingsApiKeyConfigured
source: API Key Configured
de: API-Schlüssel konfiguriert
es: Clave API configurada

# screensSettingsApiKeySettingsApiKeyDescription
source: To use AI features like meal analysis and suggestions, you need to provide your own OpenAI API key. This ensures your data stays private and you have full control.
de: Um KI-Funktionen wie Mahlzeitanalyse und Vorschläge zu nutzen, müssen Sie Ihren eigenen OpenAI API-Schlüssel bereitstellen. Dies stellt sicher, dass Ihre Daten privat bleiben und Sie die volle Kontrolle haben.
es: Para usar funciones de IA como análisis de comidas y sugerencias, necesitas proporcionar tu propia clave API de OpenAI. Esto asegura que tus datos permanezcan privados y tengas control total.

# screensSettingsApiKeySettingsApiKeyHelperText
source: Enter your OpenAI API key or leave empty to disable AI features
de: Geben Sie Ihren OpenAI API-Schlüssel ein oder lassen Sie das Feld leer, um KI-Funktionen zu deaktivieren
es: Ingresa tu clave API de OpenAI o déjalo vacío para desactivar las funciones de IA

# screensSettingsApiKeySettingsApiKeyMustStartWith
source: API key must start with "sk-"
de: API-Schlüssel muss mit "sk-" beginnen
es: La clave API debe comenzar con "sk-"

# screensSettingsApiKeySettingsApiKeyRemovedSuccessfully
source: API key removed successfully
de: API-Schlüssel erfolgreich entfernt
es: Clave API eliminada exitosamente

# screensSettingsApiKeySettingsApiKeySavedSuccessfully
source: API key saved successfully
de: API-Schlüssel erfolgreich gespeichert
es: Clave API guardada exitosamente

# screensSettingsApiKeySettingsApiKeyTestWarning
source: Your API key will be tested with a small request to verify it works. The key is only stored on your device and never sent to our servers
de: Ihr API-Schlüssel wird mit einer kleinen Anfrage getestet, um zu überprüfen, ob er funktioniert. Der Schlüssel wird nur auf Ihrem Gerät gespeichert und niemals an unsere Server gesendet
es: Su clave API será probada con una pequeña solicitud para verificar que funcione. La clave solo se almacena en su dispositivo y nunca se envía a nuestros servidores

# screensSettingsApiKeySettingsApiKeyTooShort
source: API key appears to be too short
de: API-Schlüssel scheint zu kurz zu sein
es: La clave API parece ser demasiado corta

# screensSettingsApiKeySettingsClipboardEmpty
source: Clipboard is empty
de: Zwischenablage ist leer
es: El portapapeles está vacío

# screensSettingsApiKeySettingsCouldNotLoadModels
source: Could not load available models. Using default model list
de: Verfügbare Modelle konnten nicht geladen werden. Verwende Standard-Modellliste
es: No se pudieron cargar los modelos disponibles. Usando lista de modelos predeterminada

# screensSettingsApiKeySettingsFailedToAccessClipboard
source: Failed to access clipboard
de: Zugriff auf Zwischenablage fehlgeschlagen
es: Error al acceder al portapapeles

# screensSettingsApiKeySettingsFailedToLoadApiKey
source: Failed to load API key
de: API-Schlüssel konnte nicht geladen werden
es: Error al cargar la clave API

# screensSettingsApiKeySettingsFailedToRemoveApiKey
source: Failed to remove API key
de: API-Schlüssel konnte nicht entfernt werden
es: Error al eliminar la clave API

# screensSettingsApiKeySettingsGetApiKeyFromOpenAi
source: Get API Key from OpenAI
de: API-Schlüssel von OpenAI holen
es: Obtener clave API de OpenAI

# screensSettingsApiKeySettingsGpt35ModelsInfo
source: GPT-3.5 models are more cost-effective for basic analysis
de: GPT-3.5 Modelle sind kostengünstiger für einfache Analysen
es: Los modelos GPT-3.5 son más rentables para análisis básicos

# screensSettingsApiKeySettingsGpt4ModelsInfo
source: GPT-4 models provide the best analysis but cost more
de: GPT-4 Modelle bieten die beste Analyse, kosten aber mehr
es: Los modelos GPT-4 proporcionan el mejor análisis pero cuestan más

# screensSettingsApiKeySettingsLinkError
source: An error occurred opening the link
de: Beim Öffnen des Links ist ein Fehler aufgetreten
es: Ocurrió un error al abrir el enlace
